---
kind: method
id: M:Autodesk.Revit.DB.ElementId.Equals(System.Object)
source: html/a5f86bdf-84d9-cc34-7d80-93acf4f5955b.htm
---
# Autodesk.Revit.DB.ElementId.Equals Method

Determines whether the specified Object is equal to the current Object .

## Syntax (C#)
```csharp
public override bool Equals(
	Object obj
)
```

## Parameters
- **obj** (`System.Object`) - Another object.